app/controllers/books_controller.rb

SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books"  ORDER BY created_at DESC
---
  def index
    #just a comment
    if params[:category].blank?
     @books = Book.all.order("created_at DESC")

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 6]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 6]]
---
  def show
     if @book.reviews.blank?
       @average_review =0
     else
       @average_review = @book.reviews.average(:rating).round(2)

SELECT "categories".* FROM "categories"
---
  def new
    @book = current_user.books.build
    @categories = Category.all.map{|c| [c.name, c.id]}

INSERT INTO "books" ("title", "description", "author", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Game of thrones 3"], ["description", "hmmm ok"], ["author", "sind"], ["user_id", 1], ["created_at", "2016-04-24 05:32:12.876692"], ["updated_at", "2016-04-24 05:32:12.876692"]]
---
  def create
    @book = current_user.books.build(book_params)
    @book.category_id = params[:category_id]
    if @book.save

UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Game of thrones 2"], ["updated_at", "2016-04-23 01:58:28.912218"], ["id", 2]]
---
  def update
    @book.category_id = params[:category_id]
    if @book.update(book_params)