app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.book_id = @book.id
    @review.user_id = current_user.id
    if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "nice"], ["book_id", 6], ["user_id", 2], ["created_at", "2016-04-28 00:09:25.575717"], ["updated_at", "2016-04-28 00:09:25.575717"]]

  def update
    if @review.update(review_params)
---
UPDATE "reviews" SET "rating" = ?, "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 4], ["comment", "bad"], ["updated_at", "2016-04-28 00:29:13.579696"], ["id", 1]]

  def find_book
    @book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 6]]